// Тест4
// Форму создает библиотека OneScriptForms
// Клиент запускается фоновым заданием односкрипта.
Перем Ф, ВСДОС, ВебСокетКлиент1, ПолеВвода1, ПолеВвода2, ПолеВвода3, АдресСервера, Статус, Надпись1;

Процедура ДобавитьТекст(парам)
	ПолеВвода3.ДобавитьТекст(Ф.Окружение().НоваяСтрока + парам);
КонецПроцедуры

Процедура Кнопка1_Нажатие() Экспорт
	Если Статус Тогда
		ДобавитьТекст("Сначала отключитесь от " + АдресСервера);
		ДобавитьТекст("===============================");
	Иначе
		АдресСервера = СокрЛП(ПолеВвода1.Текст);
		ВебСокетКлиент1 = ВСДОС.ВебСокетКлиент(АдресСервера);
		ВебСокетКлиент1.ПриПодключении = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриПодключении");
		ВебСокетКлиент1.ПриОтключении = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриОтключении");
		ВебСокетКлиент1.ПриПолученииСообщения = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриПолученииСообщения");
		ВебСокетКлиент1.ПриОшибке = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриОшибке");

		ВебСокетКлиент1.Подключить();
	КонецЕсли;
	
КонецПроцедуры

Процедура Кнопка2_Нажатие() Экспорт
	ВебСокетКлиент1.Отправить("" + ПолеВвода2.Текст);
КонецПроцедуры

Процедура Кнопка3_Нажатие() Экспорт
	ВебСокетКлиент1.Отключить();
	ВебСокетКлиент1 = Неопределено;
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриПодключении() Экспорт
	ДобавитьТекст("ВебСокетКлиент1_ПриПодключении " + ТекущаяДата());
	ДобавитьТекст("Отправитель = " + ВСДОС.АргументыСобытия.Отправитель + "  " + ТекущаяДата());
	ДобавитьТекст("===============================");
	Статус = Истина;
	Надпись1.Текст = "Подключен к " + АдресСервера;
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриОтключении() Экспорт
	ДобавитьТекст("ВебСокетКлиент1_ПриОтключении " + ТекущаяДата());
	
	ДобавитьТекст("Отправитель = " + ВСДОС.АргументыСобытия.Отправитель + "  " + ТекущаяДата());
	ДобавитьТекст("КодЗакрытия = " + ВСДОС.АргументыСобытия.КодЗакрытия + "  " + ТекущаяДата());
	ДобавитьТекст("ПричинаЗакрытия = " + ВСДОС.АргументыСобытия.ПричинаЗакрытия + "  " + ТекущаяДата());
	ДобавитьТекст("ЧистоеЗакрытие = " + ВСДОС.АргументыСобытия.ЧистоеЗакрытие + "  " + ТекущаяДата());
	ДобавитьТекст("===============================");
	
	Статус = Ложь;
	Надпись1.Текст = "Отключен";
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриПолученииСообщения() Экспорт
	ДобавитьТекст("ВебСокетКлиент1_ПриПолученииСообщения " + ТекущаяДата());
	ДобавитьТекст("Отправитель = " + ВСДОС.АргументыСобытия.Отправитель + "  " + ТекущаяДата());
	ДобавитьТекст("Сообщение = " + ВСДОС.АргументыСобытия.Сообщение + "  " + ТекущаяДата());
	ДобавитьТекст("===============================");
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриОшибке() Экспорт
	ДобавитьТекст("ВебСокетКлиент1_ПриОшибке " + ТекущаяДата());
	
	ДобавитьТекст("ИсключениеОшибки = " + ВСДОС.АргументыСобытия.ИсключениеОшибки + "  " + ТекущаяДата());
	ДобавитьТекст("СообщениеОшибки = " + ВСДОС.АргументыСобытия.СообщениеОшибки + "  " + ТекущаяДата());
	ДобавитьТекст("===============================");
КонецПроцедуры

ПодключитьВнешнююКомпоненту("OneScriptWebSocket.dll");
ВСДОС = Новый ВебСокетДляОдноСкрипта();
АдресСервера = "ws://localhost:4649/Echo";
// // ВебСокетКлиент1 = ВСДОС.ВебСокетКлиент(АдресСервера);
// // ВебСокетКлиент1.ПриПодключении = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриПодключении");
// // ВебСокетКлиент1.ПриОтключении = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриОтключении");
// // ВебСокетКлиент1.ПриПолученииСообщения = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриПолученииСообщения");
// // ВебСокетКлиент1.ПриОшибке = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриОшибке");

// Создадим для удобства форму с полем для адреса сервера, отправляемым текстом и кнопками управления.
ПодключитьВнешнююКомпоненту("OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();
Форма1 = Ф.Форма();
Форма1.Ширина = 700;
Форма1.Высота = 550;
Форма1.Отображать = Истина;
Форма1.Показать();
Форма1.Активизировать();

Кнопка1 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка1.Текст = "Подключиться к :";
Кнопка1.Верх = 5;
Кнопка1.Лево = 5;
Кнопка1.Ширина = 110;
Кнопка1.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка1_Нажатие");

Кнопка2 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка2.Текст = "Отправить текст";
Кнопка2.Ширина = Кнопка1.Ширина;
Кнопка2.Ниже(Кнопка1, 10);
Кнопка2.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка2_Нажатие");

Кнопка3 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка3.Текст = "Отключить";
Кнопка3.Ширина = Кнопка1.Ширина;
Кнопка3.Ниже(Кнопка2, 10);
Кнопка3.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка3_Нажатие");

ПолеВвода1 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода1.Текст = АдресСервера;
ПолеВвода1.Ширина = 550;
ПолеВвода1.Правее(Кнопка1, 10);

ПолеВвода2 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода2.Ширина = ПолеВвода1.Ширина;
ПолеВвода2.Правее(Кнопка2, 10);

ПолеВвода3 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода3.Ширина = ПолеВвода1.Ширина + Кнопка1.Ширина + 10;
ПолеВвода3.МногострочныйРежим = Истина;

ПолеВвода3.ПолосыПрокрутки = Ф.ПолосыПрокрутки.Обе;
ПолеВвода3.ПринятиеВозврат = Ложь;
ПолеВвода3.Перенос = Ложь;
ПолеВвода3.РегистрСимволов = Ф.РегистрСимволов.Стандартный;
ПолеВвода3.Высота = 400;
ПолеВвода3.Ниже(Кнопка3, 10);

Надпись1 = Форма1.ЭлементыУправления.Добавить(Ф.Надпись());
Надпись1.Ширина = ПолеВвода1.Ширина;
Надпись1.Правее(Кнопка3, 10);
Статус = Ложь;
Надпись1.Текст = "Отключен";

ДобавитьТекст("Для проверки работоспособности клиента можно подключиться на тестовый ресурс по адресу wss://echo.websocket.org/.sse");

Ф.ЗапуститьОбработкуСобытий();
//=======================================================================
