// Тест4
// Форму создает библиотека OneScriptForms
// Клиент запускается фоновым заданием односкрипта.
Перем ВСДОС, ВебСокетКлиент1, ПолеВвода1;

Процедура Кнопка1_Нажатие() Экспорт
	ВебСокетКлиент1.Подключить();
КонецПроцедуры

Процедура Кнопка2_Нажатие() Экспорт
	ВебСокетКлиент1.Отправить("" + ПолеВвода1.Текст);
КонецПроцедуры

Процедура Кнопка3_Нажатие() Экспорт
	ВебСокетКлиент1.Отключить();
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриПодключении() Экспорт
	Сообщить("ВебСокетКлиент1_ПриПодключении " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("Отправитель = " + ВСДОС.АргументыСобытия.Отправитель + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("===============================");
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриОтключении() Экспорт
	Сообщить("ВебСокетКлиент1_ПриОтключении " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Сообщить("Отправитель = " + ВСДОС.АргументыСобытия.Отправитель + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("КодЗакрытия = " + ВСДОС.АргументыСобытия.КодЗакрытия + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("ПричинаЗакрытия = " + ВСДОС.АргументыСобытия.ПричинаЗакрытия + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("ЧистоеЗакрытие = " + ВСДОС.АргументыСобытия.ЧистоеЗакрытие + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("===============================");
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриПолученииСообщения() Экспорт
	Сообщить("ВебСокетКлиент1_ПриПолученииСообщения " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("Отправитель = " + ВСДОС.АргументыСобытия.Отправитель + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("Сообщение = " + ВСДОС.АргументыСобытия.Сообщение + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("===============================");
КонецПроцедуры

Процедура ВебСокетКлиент1_ПриОшибке() Экспорт
	Сообщить("ВебСокетКлиент1_ПриОшибке " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Сообщить("ИсключениеОшибки = " + ВСДОС.АргументыСобытия.ИсключениеОшибки + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("СообщениеОшибки = " + ВСДОС.АргументыСобытия.СообщениеОшибки + "  " + ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщить("===============================");
КонецПроцедуры

ПодключитьВнешнююКомпоненту("OneScriptWebSocket.dll");
ВСДОС = Новый ВебСокетДляОдноСкрипта();
ВебСокетКлиент1 = ВСДОС.ВебСокетКлиент("ws://localhost:4649/Echo");
ВебСокетКлиент1.ПриПодключении = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриПодключении");
ВебСокетКлиент1.ПриОтключении = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриОтключении");
ВебСокетКлиент1.ПриПолученииСообщения = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриПолученииСообщения");
ВебСокетКлиент1.ПриОшибке = ВСДОС.Действие(ЭтотОбъект, "ВебСокетКлиент1_ПриОшибке");

ПодключитьВнешнююКомпоненту("OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();
Форма1 = Ф.Форма();
Форма1.Ширина = 250;
Форма1.Высота = 150;
Форма1.Отображать = Истина;
Форма1.Показать();
Форма1.Активизировать();

Кнопка1 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка1.Текст = "Подключить";
Кнопка1.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка1_Нажатие");

Кнопка2 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка2.Текст = "Отправить текст";
Кнопка2.Ниже(Кнопка1, 10);
Кнопка2.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка2_Нажатие");

Кнопка3 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка3.Текст = "Отключить";
Кнопка3.Ниже(Кнопка2, 10);
Кнопка3.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка3_Нажатие");

ПолеВвода1 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода1.Правее(Кнопка2, 10);


Ф.ЗапуститьОбработкуСобытий();
//=======================================================================
